apimartifacts/apis/numberconversion/specification.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://www.dataaccess.com/webservicesserver/" targetNamespace="http://www.dataaccess.com/webservicesserver/"><wsdl:types><xs:schema elementFormDefault="qualified" targetNamespace="http://www.dataaccess.com/webservicesserver/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:tns="http://www.dataaccess.com/webservicesserver/"><xs:element name="NumberToWords"><xs:complexType><xs:sequence><xs:element name="ubiNum" type="xs:unsignedLong" /></xs:sequence></xs:complexType></xs:element><xs:element name="NumberToWordsResponse"><xs:complexType><xs:sequence><xs:element name="NumberToWordsResult" type="xs:string" /></xs:sequence></xs:complexType></xs:element><xs:element name="NumberToDollars"><xs:complexType><xs:sequence><xs:element name="dNum" type="xs:decimal" /></xs:sequence></xs:complexType></xs:element><xs:element name="NumberToDollarsResponse"><xs:complexType><xs:sequence><xs:element name="NumberToDollarsResult" type="xs:string" /></xs:sequence></xs:complexType></xs:element></xs:schema></wsdl:types><wsdl:message name="NumberToDollars_InputMessage"><wsdl:part name="parameters" element="tns:NumberToDollars" /></wsdl:message><wsdl:message name="NumberToDollars_OutputMessage"><wsdl:part name="parameters" element="tns:NumberToDollarsResponse" /></wsdl:message><wsdl:message name="NumberToWords_InputMessage"><wsdl:part name="parameters" element="tns:NumberToWords" /></wsdl:message><wsdl:message name="NumberToWords_OutputMessage"><wsdl:part name="parameters" element="tns:NumberToWordsResponse" /></wsdl:message><wsdl:portType name="NumberConversion"><wsdl:operation name="NumberToDollars"><wsdl:input message="tns:NumberToDollars_InputMessage" /><wsdl:output message="tns:NumberToDollars_OutputMessage" /></wsdl:operation><wsdl:operation name="NumberToWords"><wsdl:input message="tns:NumberToWords_InputMessage" /><wsdl:output message="tns:NumberToWords_OutputMessage" /></wsdl:operation></wsdl:portType><wsdl:binding name="NumberConversion" type="tns:NumberConversion"><binding transport="http://schemas.xmlsoap.org/soap/http" xmlns="http://schemas.xmlsoap.org/wsdl/soap/" /><wsdl:operation name="NumberToDollars"><soap:operation soapAction="NumberToDollars" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap12/" /><wsdl:input><soap:body use="literal" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap12/" /></wsdl:input><wsdl:output><soap:body use="literal" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap12/" /></wsdl:output></wsdl:operation><wsdl:operation name="NumberToWords"><soap:operation soapAction="NumberToWords" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap12/" /><wsdl:input><soap:body use="literal" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap12/" /></wsdl:input><wsdl:output><soap:body use="literal" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap12/" /></wsdl:output></wsdl:operation></wsdl:binding><wsdl:service name="NumberConversion"><wsdl:port name="NumberConversion" binding="tns:NumberConversion"><address location="https://gateway.dev.api.lemmen.amsterdam/numberconversion/v1" xmlns="http://schemas.xmlsoap.org/wsdl/soap12/" /></wsdl:port></wsdl:service></wsdl:definitions>