src/test/resources/soap/fileconvertirnumero.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.dataaccess.com/webservicesserver/">
    <soapenv:Header/>
    <soapenv:Body>
        <web:NumberToWords>
            <web:ubiNum>%s</web:ubiNum>
        </web:NumberToWords>
    </soapenv:Body>
</soapenv:Envelope>