src/test/resources/numbertowordrequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <NumberToWords xmlns="http://www.dataaccess.com/webservicesserver/">
            <ubiNum>5958</ubiNum>
        </NumberToWords>
    </soap:Body>
</soap:Envelope>