resources/views/xmls/helloWorld.blade.php

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:web="http://www.dataaccess.com/webservicesserver/">
   <soap:Header/>
   <soap:Body>
      <web:NumberToWords>
         <web:ubiNum>10</web:ubiNum>
      </web:NumberToWords>
   </soap:Body>
</soap:Envelope>